#+TITLE: Emacs Literatie Configuration
#+AUTHOR: Eric Gade (darth-cheney)
#+STARTUP: show2levels indent hidestars
#+PROPERTY: header-args :tangle (let ((org-use-tag-inheritance t)) (if (member "INACTIVE" (org-get-tags))  "no" "~/.emacs.d/init.el")))
**** General Settings
#+begin_src emacs-lisp
(use-package org)
;; Basic Defaults
(setq-default org-ellipsis " …"              ; Nicer ellipsis
            org-tags-column 1              ; Tags next to header title
            org-hide-emphasis-markers t    ; Hide markers
            org-cycle-separator-lines 2    ; Number of empty lines between sections
            org-use-tag-inheritance nil    ; Tags ARE NOT inherited 
            org-use-property-inheritance t ; Properties ARE inherited
            org-indent-indentation-per-level 2 ; Indentation per level
            org-link-use-indirect-buffer-for-internals t ; Indirect buffer for internal links
            org-fontify-quote-and-verse-blocks t ; Specific face for quote and verse blocks
            org-return-follows-link nil    ; Follow links when hitting return
            org-image-actual-width nil     ; Resize image to window width
            org-indirect-buffer-display 'other-window ; Tab on a task expand it in a new window
            org-outline-path-complete-in-steps nil ; No steps in path display
            org-return-follows-link t) ;Self explanatory
#+end_src

Use ~org-modern~ to make org mode start to look nice
#+begin_src emacs-lisp
(use-package org-modern
:hook (org-mode . org-modern-mode))
#+end_src

Use some custom capture templates
#+begin_src emacs-lisp
(defun eg/get-project-org-capture-file ()
  (concat (projectile-project-root) "todo.org"))
(defun eg/org-capture-get-line-number-string ()
  "Get the line number as a string from an org-capture session"
  )
(setq org-capture-templates
      '(("t" "Basic TODO" entry (file+headline "todo.org" "Basic Tasks")
         "* TODO %?\n %i\n %a")
        ("p" "Project TODO" entry (file+headline (lambda () (eg/get-project-org-capture-file)) "Project Tasks")
         "* TODO %?\n %t\n In file: [[file:%F::%(with-current-buffer (org-capture-get :original-file-nondirectory) (number-to-string (line-number-at-pos)))][%f]]\n\n")))
#+end_src

#+RESULTS:
| t | Basic TODO | entry | (file+headline todo.org Basic Tasks) | * TODO %? |

